<?php

$a = 0;
$b = 0;


for ($i = 0; $i <= 5; $i++) {
   $a += 10;
   $b += 5;
   
   echo "Переменная a равна " . $a . ". Переменная b равна " . $b . ".\n";
}

echo "Конец цикла: a = $a, b = $b";



// $i = 0;

// while ($i <= 5) {
//     $a += 10;
//     $b += 5;
//     $i++;

//     echo "Переменная a равна " . $a . ". Переменная b равна " . $b . ".\n";
// }

// echo "Конец цикла: a = $a, b = $b";



// do {
//     $a += 10;
//     $b += 5;
//     $i++;

//     echo "Переменная a равна " . $a . ". Переменная b равна " . $b . ".\n";
// } while ($i <= 5);

// echo "Конец цикла: a = $a, b = $b";